*&---------------------------------------------------------------------*
*& Program SAPMZC1MM0001
*&---------------------------------------------------------------------*
*&
*&---------------------------------------------------------------------*
*&---------------------------------------------------------------------*
*& Program ID    : SAPMZC1MM0001 (자재마스터 관리)
*& Program Name  : 자재마스터 관리 프로그램
*& Module        : MM
*& T-Code        :
*& Created By    : 홍승욱 (NCODE-C-29)
*& Created On    : 2026.04.06
*& Description   : 자재마스터 관리 프로그램
*&---------------------------------------------------------------------*
*& [ Modification History ]
*& Date        Developer     Description
*&---------------------------------------------------------------------*
*& 2026.04.06  홍승욱        개발시작
*& 2026.04.07  홍승욱        이미지 팝업 추가
*& 2026.04.28  홍승욱        기능보완 및 ui수정
*&---------------------------------------------------------------------*

INCLUDE sapmzc1mm0001_top.                       .    " Global Data

INCLUDE sapmzc1mm0001_c01.                       .    " ALV Events
INCLUDE sapmzc1mm0001_o01.                       .    " PBO-Modules
INCLUDE sapmzc1mm0001_i01.                       .    " PAI-Modules
INCLUDE sapmzc1mm0001_f01.                       .    " FORM-Routines
