*&---------------------------------------------------------------------*
*& Report ZRC1MM0005
*&---------------------------------------------------------------------*
*&
*&---------------------------------------------------------------------*
*&---------------------------------------------------------------------*
*& Program ID    : ZRC1MM0005 (구매오더 관리)
*& Program Name  : 구매오더 관리 프로그램
*& Module        : MM
*& T-Code        :
*& Created By    : 홍승욱 (NCODE-C-29)
*& Created On    : 2026.04.21
*& Description   : 구매오더 관리 및 상신 연동(Fiori)
*&---------------------------------------------------------------------*
*& [ Modification History ]
*& Date        Developer     Description
*&---------------------------------------------------------------------*
*& 2026.04.21  홍승욱        화면 설계
*& 2026.04.22  홍승욱        화면 구현
*& 2026.04.23  홍승욱        화면 구현 및 조회 로직
*& 2026.04.24  홍승욱        ALV Tree
*& 2026.04.30  홍승욱        구매오더 결재 탭
*& 2026.05.04  홍승욱        결재버튼 Fiori 연동
*& 2026.05.11  홍승욱        UI 수정 및 Fiori 연동 구체화
*&---------------------------------------------------------------------*
INCLUDE zrc1mm0005_top                          .    " Global Data

INCLUDE zrc1mm0005_c01                          .  " ALV Events
INCLUDE zrc1mm0005_o01                          .  " PBO-Modules
INCLUDE zrc1mm0005_i01                          .  " PAI-Modules
INCLUDE zrc1mm0005_f01                          .  " FORM-Routines


**********************************************************************
* START-OF-SELECTION
**********************************************************************
START-OF-SELECTION.
  PERFORM lock.
  PERFORM set_appr_auth.

  CALL SCREEN 100.
