*&---------------------------------------------------------------------*
*&---------------------------------------------------------------------*
*& Report ZRC1MM0004
*&---------------------------------------------------------------------*
*&
*&---------------------------------------------------------------------*
*&---------------------------------------------------------------------*
*& Program ID    : ZRC1MM0004 (구매요청 관리)
*& Program Name  : 구매요청 관리 프로그램
*& Module        : MM
*& T-Code        : ZRC1MM0004
*& Created By    : 홍승욱 (NCODE-C-29)
*& Created On    : 2026.04.08
*& Description   : 구매요청 관리 및 상세정보 확인
*&---------------------------------------------------------------------*
*& [ Modification History ]
*& Date        Developer     Description
*&---------------------------------------------------------------------*
*& 2026.04.08  홍승욱        화면설계
*& 2026.04.09  홍승욱        개발시작
*& 2026.04.10  홍승욱        화면 구성 완료
*& 2026.04.13  홍승욱        PR 헤더 조회 및 상태별 버튼 조회
*& 2026.04.14  홍승욱        더블클릭 이벤트 : 동적 html헤더 + 상세정보 / PR 헤더에서 전체 PO전환
*& 2026.04.15  홍승욱        테이블 수정에 따른 ALV 필드 추가 / PR 아이템에서 PO전환 / 삭제필드 처리 로직
*& 2026.04.16  홍승욱        상세정보 금액 세팅 및 수정팝업창 생성
*& 2026.04.17  홍승욱        수정팝업창 로직 및 업데이트 로직 / 총 예상금액 계산식
*& 2026.04.20  홍승욱        수동생성 창
*& 2026.04.23  홍승욱        화면 및 기능 수정
*&---------------------------------------------------------------------*

INCLUDE zrc1mm0004_top                          .    " Global Data

INCLUDE zrc1mm0004_c01                          .  " ALV Events
INCLUDE zrc1mm0004_o01                          .  " PBO-Modules
INCLUDE zrc1mm0004_i01                          .  " PAI-Modules
INCLUDE zrc1mm0004_f01                          .  " FORM-Routines

**********************************************************************
* INITIALIZATION
**********************************************************************
INITIALIZATION.
  PERFORM init_create_row.
**********************************************************************
* START-OF-SELECTION
**********************************************************************
START-OF-SELECTION.
  CALL SCREEN 100.
